/*
จงเขียนโปรแกรมเพื่อรับคำจากผู้ใช้งาน เพื่อตรวจสอบว่า คำที่กรอกมามีลักษณะเป็นคำหรือวลีที่สามารถอ่านจากหลังไปหน้าหรือหน้าไปหลังแล้วยังคงความหมายเหมือนเดิมได้ 
โดยที่ หากคำนั้นสามารถอ่านจากหน้าไปหลังหรือหลังไปได้ ให้แสดงผลลัพธ์ว่า Pass แต่หากทำไม่ได้ให้ขึ้นว่า Not Pass
*/
#include <stdio.h>
#include <string.h>
int main() {
    char str[100];
    int len, i ,flag = 1;

    printf("input :");
    scanf("%s", str); // รับ string จากผู้ใช้ (หยุดเมื่อมีช่องว่าง)

    len = strlen(str); // หาความยาว string

    // ลูปตรวจจากหัว ไป ท้าย
    for ( i = 0; i < len / 2; i++)
    {
        if (str[i] != str[len - i - 1] ) {// ถ้าตรวจแล้วไม่ตรงกัน (หัว - ท้าย และ ท้าย - หัว)
            flag = 0; // ไม่ตรงกัน (สะกดย้อนกลับไม่ได้) ให้เป็น 0
            break;
        }
    }

    if (flag) {
        printf("Pass\n"); // ถ้าอ่านย้อนกลับได้
    } else {
        printf("Not pass\n"); // ถ้าอ่านย้อนกลับไม่ได้
    }
 
    return 0;
}