
/*
    รับตัวเลขจากผู้ใช้มา 2 จำนวน เพื่อแสดงแม่สูตรคูณบนหน้าจอคอมพิวเตอร์ โดยแสดงแม่สูตรคูณจากตัวเลขแรกที่รับจากผู้ใช้ ไปสิ้นสุดยังตัวเลขสุดท้ายที่รับจากผู้ใช้
    (โจทย์ข้อนี้ให้ใช้ For Loop เท่านั้น)
    
*/
#include <stdio.h>

int main() {
    int start, end;
    
    printf("Enter start: ");
    scanf("%d", &start);
    printf("Enter end: ");
    scanf("%d", &end);

    for (int j = start; j <= end; j++) {       // วนตามแม่สูตรคูณ
        for (int i = 1; i <= 12; i++) {        // วนเลขคูณตั้งแต่ 1 ถึง 12
            printf("%d x %d = %d\n", j, i, j * i);
        }
        printf("\n"); // เว้นบรรทัดระหว่างแต่ละแม่
    }

    return 0;
}
